app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations" WHERE ((conversations.author_id = 1 OR conversations.receiver_id = 1)) ORDER BY updated_at DESC
---
 def index
   @conversations = Conversation.participating(current_user).order('updated_at DESC')

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def show
   @conversation = Conversation.find_by(id: params[:id])

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def set_conversation
   @conversation = Conversation.find_by(id: params[:id])